[
  {
    "file_name": "Kartik_Goswami_AfternoonFinance_AIEngineer_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence, Newcastle University, UK (Expected Sep 2024 - Sep 2025)\n- Skills: \n  - Languages: Python, SQL\n  - Frameworks: PyTorch, HuggingFace Transformers, Scikit-learn, FastAPI\n  - NLP: LLMs, Embeddings, Text Classification, Transformers, Named Entity Recognition\n  - Cloud & Deployment: REST APIs, Docker, Git, Streamlit, MLflow, Pydantic\n  - Other: OCR, Tabular Modeling, CV (basic), Dataclasses, Synthetic Data (exploratory)\n- Experience:\n  - AI Engineer and Data Scientist\n  - Built and deployed LLM-powered multimodal classifier for idiomatic phrases\n  - Developed an end-to-end system that ranks resume-job fit and returns natural language explanations\n  - Deployed real-world summarization engine for long financial and academic documents using transformers\n  - Created a real-time image recognition & expression classification app for emotion tracking\n  - Built and versioned ML lifecycle with full deployment stack\n  - AI Club Organizer at Newcastle University\n  - Volunteer instructor for school-level Python coding programs\n  - Open-source contributor for NLP/CV community projects"
  },
  {
    "file_name": "Kartik_Goswami_AI_Data_Engineer_SportsBrand_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence from Newcastle University, UK (Expected Sep 2025). Focus on Machine Learning, Data Engineering, Cloud Analytics, Predictive Modeling.\n- Skills: Python, SQL, AI Tools (ChatGPT, LangChain, Make.com, Zoho Zia), Machine Learning (Classification, Regression, Clustering, Forecasting), Data Engineering (ETL, Data Cleaning, Feature Engineering, Pandas, NumPy), Visualization (Streamlit, Matplotlib, Seaborn), REST APIs, Git, Docker, Google Colab, CI/CD.\n- Experience: \n  - AI Data Engineer: Strong background in Python, SQL, and building AI-driven data pipelines. Experienced in turning raw data into actionable insights and developing machine learning models that improve customer retention, personalization, and marketing performance.\n  - Relevant Projects: \n    - Customer Retention Predictor: Built a binary classification model using user behavior data to predict churn in a simulated e-commerce platform.\n    - AI-Powered Marketing Dashboard: Integrated ChatGPT and LangChain into a Streamlit dashboard for campaign performance analysis.\n    - Forecasting Sales with Regression: Created an ML model to forecast sales based on seasonality, pricing, and marketing inputs.\n    - AI Job Match Explainer: Converted job descriptions and resumes into embeddings for match scoring and insight generation."
  },
  {
    "file_name": "Kartik_Goswami_AI_Engineer_Consultancy_Fresher_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence, Newcastle University, UK (Expected Sep 2024 - Sep 2025)\n- Skills: \n  - Languages: Python, SQL\n  - Frameworks: Hugging Face, LangChain, LangGraph, PyTorch, Scikit-learn\n  - NLP & LLMs: Transformers, Embeddings, RAG, Generative AI, Conversational AI\n  - MLOps: MLflow, FastAPI, Git, Docker (basic)\n  - Cloud Familiarity: AWS, GCP (introductory), REST API integration\n  - Software Skills: Modular Coding, Vector DBs, Lightweight Deployment\n- Experience: \n  - Job Titles: AI Engineer, Organizer of GenAI workshops at Newcastle University AI Club\n  - Summary: Strong hands-on experience delivering LLM-based projects using Hugging Face, LangChain, and LangGraph. Skilled in applying foundational NLP and GenAI to solve real-world problems through self-initiated projects and collaborative academic work. Developed several AI projects including an AI assistant, a transformer-based classifier, a resume matching tool, and a document summarizer."
  },
  {
    "file_name": "Kartik_Goswami_AI_Engineer_ConsultingFirm_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence from Newcastle University, UK (Expected Sep 2025)\n- Skills: \n  - Languages: Python, SQL\n  - Frameworks & Libraries: PyTorch, Scikit-learn, Pandas, NumPy, Streamlit, SciPy\n  - AI/ML Expertise: NLP, Computer Vision, Generative AI, LLMs, Classification Models, Analytics\n  - MLOps: MLflow, Docker, CI/CD, Git, API deployment, Model lifecycle tracking\n  - Cloud: Microsoft Azure (familiar), AWS, GCP (basic knowledge)\n  - Business Impact: Problem Scoping, Stakeholder Communication, Value-driven Delivery\n- Experience: \n  - Job Title: Artificial Intelligence Engineer\n  - Summary: Has hands-on experience designing and deploying ML/NLP solutions in real-world business environments. Skilled in using Python, PyTorch, and cloud-based platforms to build scalable and impactful AI systems. Adept at applying statistical techniques and ML algorithms to solve complex client challenges, with strong consulting communication and collaboration abilities. Has worked on several relevant projects including AI Job Match Explainer, PDF Summarizer, Multimodal Idiomaticity Classifier, and MLflow Pipeline."
  },
  {
    "file_name": "Kartik_Goswami_AI_Engineer_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence, Newcastle University, UK (Expected Sep 2024 - Sep 2025)\n- Skills: \n  - Languages: Python, R, SQL\n  - Frameworks: PyTorch, TensorFlow, HuggingFace Transformers, Scikit-learn\n  - Specialties: Deep Learning, NLP, Computer Vision, Generative AI, Reinforcement Learning\n  - Tools: Docker, Git, MLflow, Streamlit, VS Code\n  - Cloud & Deployment: AWS, GCP, Azure, REST APIs, MLOps\n  - Big Data: Spark, Hadoop\n  - Responsible AI: Fairness, Bias Mitigation, Ethical AI Deployment\n- Experience:\n  - Job Title: AI Engineer\n  - Summary: Proven experience in training and deploying deep learning, NLP, and generative AI models using PyTorch, HuggingFace, and TensorFlow. Adept at integrating AI into cloud-based systems and streamlining model deployment with MLOps tools. Strong communicator and collaborator who bridges the gap between technical innovation and business impact.\n  - Project Experience:\n    - Multimodal Idiomaticity Classifier\n    - Facial Mood Monitor\n    - AI Job Match Explainer\n    - PDF Summarizer\n    - MLflow MLOps Pipeline"
  },
  {
    "file_name": "Kartik_Goswami_AI_Engineer_DRW_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence from Newcastle University, UK (Expected completion: Sep 2025)\n- Skills: \n  - Languages: Python, SQL\n  - Frameworks & Tools: PyTorch, TensorFlow, Hugging Face, MLflow, ONNX, LangChain, LangGraph\n  - MLOps: CI/CD, MLflow, Model Stores, Feature Stores, Docker, FastAPI, GitHub Actions\n  - AI/ML: LLMs, RAG, Transformers, Fine-Tuning, Prompt Engineering, Classification, Forecasting\n  - Compute: GPU Optimization (CUDA-based pipelines), AWS EC2/GPU, Parallel Processing\n  - DevOps/Infrastructure: REST APIs, Vector Stores, Lightweight Containers, Streamlit\n- Experience:\n  - RAG-Based Market Research Agent: Developed a LangGraph-powered financial analyst bot with document retrieval and grounded response generation.\n  - PDF Summarizer + Continuous Evaluation Loop: Created an LLM summarizer with model performance tracking and prompt versioning for academic and financial content.\n  - MLflow Production Pipeline: Built a full-cycle ML pipeline with data versioning, model training, and real-time scoring with alerts.\n  - AI Job Match Explainer: Constructed an AI-driven pipeline to score CV-job pairs using LLM embeddings and a scalable FastAPI interface."
  },
  {
    "file_name": "Kartik_Goswami_AI_Engineer_Personalisation_Remote_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence, Newcastle University, UK (Expected Sep 2024 - Sep 2025)\n- Skills: \n  - Languages: Python, SQL\n  - Libraries & Frameworks: Hugging Face Transformers, PyTorch, TensorFlow, LangChain, Scikit-learn\n  - AI Applications: LLMs, NLP, Sentiment Analysis, Personalized Recommendation Engines, RAG\n  - MLOps: MLflow, Docker, FastAPI, GitHub Actions, Streamlit\n  - Cloud: GCP, AWS (familiar), REST APIs, Cloud Functions, Vertex AI (prototype)\n- Experience: \n  - AI Engineer with experience in building intelligent, human-centered systems\n  - Built a prototype recommendation engine that adapted responses to user sentiment and past queries\n  - Created a LangGraph assistant with memory and real-time retrieval to personalize long user chats\n  - Developed a model to provide context-aware job match scores and dynamic explanations\n  - Created a real-time summarization app with LLMs for personalized customer insights\n  - Organized a Personalised AI + UX integration workshop at university AI Club\n  - Contributed to open-source recommendation tooling and LangChain pipelines\n  - Completed 15+ real-world projects showcasing contextual reasoning and adaptive LLM behavior."
  },
  {
    "file_name": "Kartik_Goswami_AI_Scientist_Zellis_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence from Newcastle University, UK (Expected Sep 2024 - Sep 2025). Specialization in GenAI, HR Automation, Predictive Modeling, Cloud AI.\n- Skills: \n  - Languages: Python, SQL, JavaScript (basic)\n  - Frameworks: Hugging Face Transformers, LangChain, LangGraph, PyTorch, TensorFlow\n  - NLP/GenAI: RAG, Prompt Engineering, Fine-Tuning, RLHF (conceptual), Natural Language to Code/SQL/LaTeX\n  - Speech/Text: Text-to-SQL, Text-to-Diagram, Text Summarization\n  - MLOps: MLflow, FastAPI, Git, CI/CD, Monitoring\n  - Cloud: AWS, Azure (familiar), Docker, REST APIs\n  - Data Engineering: Feature Engineering, Entity Disambiguation, Semantic Search, Vector Databases\n- Experience:\n  - AI Assistant: Natural Language to SQL - Built a GenAI tool that translated natural language questions into executable SQL queries.\n  - RAG-based HR Helpdesk Agent - Deployed an agentic RAG architecture to answer HR-related queries based on internal policy documents.\n  - LLM Summarizer & Diagram Generator - Created summarization and NL2diagram solution using prompt chaining and Hugging Face transformers.\n  - Multimodal Idiomaticity Classifier - Developed explainable text-image classifier trained on contextual idioms."
  },
  {
    "file_name": "Kartik_Goswami_EarlyCareer_AI_Engineer_London_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence from Newcastle University, UK (Expected Sep 2024 - Sep 2025)\n- Skills: Python, SQL, LLMs, NLP, Classification Models, Transformers, Data Science Pipelines, Scikit-learn, PyTorch, Hugging Face Transformers, Streamlit, Git, Jupyter, FastAPI, Data Wrangling, Preprocessing, First-Party Data Analysis, AWS/GCP basics, Docker\n- Experience: \n  - AI Job Match Explainer: Built NLP model pipeline to analyze resumes and job descriptions with explainable LLM feedback.\n  - PDF Summarizer: Developed an LLM summarization model that processes long-form academic text into concise summaries.\n  - ML Pipeline with MLflow: Developed an end-to-end ML pipeline with training, evaluation, and versioning.\n  - Multimodal Idiomaticity Classifier: Fine-tuned LLMs for semantic classification using image and text datasets.\n  - Organizer: GenAI & NLP workshops at Newcastle AI Club\n  - Volunteer Python mentor for university beginners\n  - Personal portfolio of 15+ end-to-end AI/ML projects"
  },
  {
    "file_name": "Kartik_Goswami_Exeter_MLEngineer_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence, Newcastle University, UK (Expected Sep 2024 - Sep 2025)\n- Skills: \n  - Languages: Python, SQL, R\n  - Frameworks: TensorFlow, Scikit-learn, PyTorch, Pandas, NumPy\n  - Techniques: Predictive Analytics, Time Series Forecasting, Statistical Modeling, Supervised & Unsupervised Learning\n  - Deployment: Streamlit, MLflow, REST APIs, Docker\n  - Cloud: AWS, GCP, Azure\n  - Tools: Jupyter, VS Code, Git, Tableau\n- Experience: \n  - Job Title: Machine Learning Engineer\n  - Summary: Has hands-on experience deploying predictive analytics and automation solutions. Skilled in using Python, TensorFlow, and Scikit-learn to improve operational efficiency and enable data-driven decisions. Has proven ability to collaborate across business and technical teams to implement ML strategies that deliver impact. Passionate about driving innovation in real-world settings like manufacturing and supply chain optimization. Has worked on several projects including AI Investment Analyst, MLflow MLOps Pipeline, Food Calorie Estimator, and Facial Mood Monitor."
  },
  {
    "file_name": "Kartik_Goswami_FoundingMLEngineer_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence from Newcastle University, UK (Expected completion: Sep 2025)\n- Skills: \n  - Languages: Python, SQL, R\n  - Frameworks: PyTorch, HuggingFace Transformers, TensorFlow, Llama.cpp\n  - Specializations: NLP, LLMs, Transformers, Vision, Transfer Learning\n  - Tools: Docker, Git, Streamlit, LangChain, MLflow, VS Code\n  - Systems: GPU training, REST API deployment, Model evaluation pipelines\n  - Cloud & Big Data: Spark, Hadoop (basic), AWS/GCP familiarity\n- Experience: \n  - Job Titles: Machine Learning Engineer, AI Club Organizer at Newcastle University\n  - Summary: Experienced in building safe, high-quality AI systems that scale, including full ML pipelines, neural network development, LLM application building, and real-time deployments. Has a strong focus on evaluation, reliability, and user impact. Has worked on various projects including a Multimodal Idiomaticity Classifier, AI Investment Analyst, AI Job Match Explainer, Food Calorie Estimator, and MLflow MLOps Pipeline."
  },
  {
    "file_name": "Kartik_Goswami_Graduate_AI_Engineer_AgenticAI_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence, Newcastle University, UK (Expected Sep 2025)\n- Skills: \n  - Languages: Python, SQL, JavaScript\n  - Frameworks: LangChain, HuggingFace Transformers, PyTorch, Scikit-learn\n  - AI Techniques: LLMs, Agentic AI, NLP, Deep Learning, Predictive Analytics\n  - Tools: Streamlit, Git, Docker, FastAPI, MLflow\n  - Cloud & Deployment: AWS, Azure, GCP, MLOps practices\n  - Software Principles: Prototyping, Clean Code, Version Control, CI/CD pipelines\n- Experience:\n  - AI Job Match Explainer: Developed an LLM-powered agent system for ranking resumes against job posts and generating explainable outputs.\n  - Multimodal Idiomaticity Classifier: Created a transformer-based classifier with paraphrased augmentation and zero-shot baseline.\n  - PDF Summarizer: Developed a document summarization tool using LLMs to compress long academic texts.\n  - Agentic RAG System (Prototype): Experimented with LangChain Agents and Deepseek to implement a local vector database-backed retrieval system.\n  - AI Club Organizer: Led sessions on Agentic AI, LLM architectures, and FastAPI integration.\n  - Volunteer mentor for beginner Python learners.\n  - Built 15+ real-world AI projects with hands-on deployments and evaluations."
  },
  {
    "file_name": "Kartik_Goswami_Graduate_Data_Engineer_Lowell_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence, Newcastle University, UK (Expected Sep 2024 - Sep 2025)\n- Skills: \n  - Languages: Python, SQL\n  - Cloud & Tools: Azure Data Factory, Databricks, Pandas, NumPy\n  - Data: Data Wrangling, ETL Pipelines, Cleansing & Transformation, Data Modeling\n  - Frameworks: Scikit-learn, Streamlit, Jupyter\n  - Version Control & Workflow: Git, VS Code, GitHub\n  - Soft Skills: Communication, Problem-Solving, Adaptability, Stakeholder Engagement\n- Experience:\n  - Project: MLflow MLOps Pipeline - Developed and deployed a full machine learning lifecycle pipeline from data ingestion to model versioning using Scikit-learn and Hyperopt. Demonstrated collaboration and governance best practices.\n  - Project: PDF Summarizer - Built a document processing and extraction pipeline using Hugging Face's T5 transformer, summarizing long-form text into concise formats.\n  - Project: AI Job Matcher - Created an LLM-based tool to match resumes to job descriptions and return natural language insights.\n  - Extra-Curricular & Development: AI Club Organizer at Newcastle University, Finalist at AI for Social Good Hackathon 2024, Volunteer Python coding mentor for beginner and school-level learners, Regular contributor to open-source AI and data pipeline projects."
  },
  {
    "file_name": "Kartik_Goswami_Lead_Python_SQL_Developer_Fintech_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence from Newcastle University, UK (Expected completion Sep 2025)\n- Skills: Python, SQL, Oracle, PostgreSQL, MySQL, Microsoft Azure, Azure Power Platform (Power BI, Logic Apps), GCP (Notebook LM), OpenAI (GPT-4), Google Gemini, Claude AI, Microsoft CoPilot, LangChain, Streamlit, Tableau, Power BI, FastAPI, Flask, Pandas, NumPy, GitHub Actions, Docker, MLflow\n- Experience: \n  - Lead Python + SQL Developer\n  - Custom GPT + Chatbot Deployment (Finance Sim): Developed and deployed a GPT-powered chatbot for customer support and financial query routing using OpenAI and Azure integration.\n  - Financial Insights Generator using Gemini: Created an interactive financial trends analyzer that used Google Gemini APIs to generate insights from tabular and unstructured reports.\n  - SQL & Python Automation for Financial Reporting: Automated monthly reporting for simulated fintech dashboards with stored procedures and dynamic SQL visualizations.\n  - RAG-Based Document Retriever: Built a real-time financial document assistant using OpenAI, LangGraph, and FAISS.\n  - Lead AI engineer for multiple LLM prototype deployments (LangChain, Claude, Gemini)"
  },
  {
    "file_name": "Kartik_Goswami_Media_GenAI_Engineer_London_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence, Newcastle University, UK (Expected Sep 2024 - Sep 2025)\n- Skills: Python, SQL, JavaScript, LangGraph, CrewAI, OpenAI APIs, Hugging Face Transformers, PyTorch, TensorFlow, Scikit-learn, Docker, Kubernetes, CI/CD, GitHub Actions, MLflow, AWS, GCP, Terraform, PostgreSQL, MongoDB, NoSQL, Prometheus, Grafana, REST APIs, Vector DBs, LangChain agents\n- Experience: \n  - AI Engineer with experience in building and deploying GenAI and LLM-powered systems\n  - Project: Agentic AI RAG System (Implemented local vector database-backed LangGraph retrieval system using OpenAI + CrewAI agents for autonomous task flows)\n  - Project: AI Job Match Explainer (Developed LLM-powered REST-based tool for resume-job matching with explainable outputs)\n  - Project: PDF Summarizer (Created NLP-based summarization service using HuggingFace transformers, deployed as a web app)\n  - Project: Multimodal Idiomaticity Classifier (Developed NLP and image-based classifier using transformer embeddings and paraphrased data augmentation)"
  },
  {
    "file_name": "Kartik_Goswami_Newcastle_AIEngineer_FinTech_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence, Newcastle University, UK (Expected Sep 2024 - Sep 2025)\n- Skills: Python, C++, Java, SQL, LLMs, NLP, Transformers, Deep Learning, Text Classification, Embeddings, PyTorch, HuggingFace Transformers, Scikit-learn, TensorFlow, OOP, Algorithms, Data Structures, Design Patterns, APIs, Git, Docker, MLflow, FastAPI, VS Code, End-to-End Pipelines, MLOps, REST API Integrations, Streamlit, OCR, Cloud Familiarity (AWS/GCP)\n- Experience:\n  - Job Title: AI Engineer\n  - Summary: Strong experience in AI engineering with a focus on Python, LLMs, and NLP. Skilled in building scalable, data-centric AI systems using modern software engineering practices. Has strong academic credentials and experience in bringing AI innovations into production. Has worked on several projects including building a multimodal idiomaticity classifier, an AI investment analyst, a PDF summarizer, an AI job matcher, and an MLflow MLOps pipeline. Has also contributed to open-source AI projects and mentored others in Python."
  },
  {
    "file_name": "Kartik_Goswami_StarlingBank_GenAI_Engineer_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence, Newcastle University, UK (Expected Sep 2024 - Sep 2025)\n- Skills: \n  - Languages: Python, SQL\n  - GenAI/LLM: Hugging Face, LangChain, LangGraph, GPT-4, Llama\n  - Modeling: Classification, Text Generation, Evaluation, RAG, Fine-Tuning\n  - MLOps: MLflow, CI/CD, Docker, FastAPI, Monitoring & Evaluation Pipelines\n  - Cloud: GCP (Vertex AI), AWS (Bedrock), REST APIs\n  - Dev Practices: Git, Modular Code, Prompt Engineering, Model Coherence, Hallucination Reduction\n- Experience:\n  - Machine Learning Engineer: Built and deployed NLP and LLM-powered applications using Hugging Face, LangChain, Vertex AI, and Python. Focused on solving fintech problems with scalable ML models and modern MLOps practices.\n  - Relevant Projects:\n    - GenAI PDF Summarizer: Developed an LLM-based document summarizer for dense financial texts.\n    - RAG-Based Question Answering Agent: Built a production-ready assistant using LangGraph and OpenAI APIs.\n    - AI Job Match Explainer: Created a system to align CVs with job specs using generative feedback and ranking logic.\n    - Multimodal Idiomaticity Classifier: Built and evaluated a semantic understanding pipeline using text-image input and transformer tuning.\n  - Extra-Curricular & Community: AI Club Organizer, Contributor to open-source LLM deployments, Team collaborator with real-world delivery experience across 15+ deployed projects."
  },
  {
    "file_name": "Kartik_Goswami_Trainline_ML_Engineer_CV.pdf",
    "analysis": "- Name: Kartik Goswami\n- Education: MSc in Data Science and Artificial Intelligence, Newcastle University, UK (Expected Sep 2024 - Sep 2025)\n- Skills: \n  - Languages: Python, SQL, PySpark\n  - ML/NLP: Transformers, LLMs, LangChain, Classification, Regression, Recommenders, RAG\n  - Frameworks: Scikit-learn, Hugging Face, LightGBM, TensorFlow, LangGraph\n  - Data Tools: Pandas, Numpy, Feature Engineering, Airflow\n  - MLOps: MLflow, Docker, Terraform (basic), CI/CD, Git\n  - Cloud & Infra: AWS (ECS, EMR, Athena), Streamlit, REST APIs\n  - Agile/DevOps: GitHub Actions, Model Versioning, Agile Scrum\n- Experience:\n  - Job Title: Machine Learning Engineer\n  - Summary: Proficient in building and deploying NLP and recommendation systems using Python, PySpark, and MLOps tools. Experienced in full-cycle model delivery, including data prep, tuning, evaluation, and cloud deployment. Has worked on projects like Multimodal Idiomaticity Classifier, AI Job Match Explainer, PDF Summarizer, and Agentic AI Search (Prototype). Also, has contributed to open-source ML projects with a focus on recommender systems and transformers."
  }
]